enfieldcat/ESP32_miniThrottle/serialTerm.ino
/*
miniThrottle, A WiThrottle/DCC-Ex Throttle for model train control

MIT License

Copyright (c) [2021-2024] [Enfield Cat]

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/


static char* consCmdHistory = NULL;  // ring buffer for command history
static int consCmdHistoryStart = 0;  // First (oldest) byte in command history
static int consCmdHistoryEnd = 0;    // Next (newest) byte in command history
//static int consCmdHistoryReq = 0 ;   // requested command relative to latest in history. 0 = none requested, 1 = previous, 2 = one prior, etc


void saveCursorPosition()
{
  const char command[] = { 27, '7', '\0' };
  Serial.printf ((char*) command);
} 
 
 
void restoreCursorPosition()
{
  const char command[] = { 27, '8', '\0' };
  Serial.printf ((char*) command);
} 
 
 
void erase2eol()
{
  static char command[] = { 27, '[', '0', 'K', '\0' };
  Serial.printf ((char*) command);
} 
 
 
 
/*
 * List all command line history
 */
void cmdGetHistory ()
{
  char outBuffer[BUFFSIZE];
  uint16_t srcPtr = consCmdHistoryStart;
  uint16_t dstPtr = 0;
 
  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s cmdGetHistory()\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }
  while (srcPtr != consCmdHistoryEnd)
  {
    outBuffer[dstPtr] = consCmdHistory[srcPtr];
    if (outBuffer[dstPtr] == '\0') {
      dstPtr = 0;
      if (outBuffer[0] != '\0') Serial.printf ("%s\r\n", outBuffer);
    }
    else dstPtr++;
    if (++srcPtr == COMMAND_HISTORY) srcPtr = 0;
  }
}
 
 
/*
 * Pull a prior command from the command history stack
 */
char* cmdGetHistoryLine (int8_t direction, bool reset)
{ 
  static int16_t depth = 0;
  int16_t curptr;
  uint16_t backCount;
  uint16_t n = 0;
  static char histBuffer[BUFFSIZE];
  char msgBuffer[5];
 
  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s cmdGetHistoryLine(%d, bool)\r\n", getTimeStamp(), direction);
    xSemaphoreGive(consoleSem);
  }
  // reset
  if (reset) {
    depth = 0;
    histBuffer[0] = '\0';
    return (histBuffer);
  }
  // no history
  if (consCmdHistoryStart == consCmdHistoryEnd) {
    histBuffer[0] = '\0';
  }
  else {
    // work out direction
    if (direction>0) {
      depth++;
      }
    else {
      depth--;
      if (depth <  0) depth = 0;
      if (depth == 0) return (NULL);
      }
    // find start of command
    curptr = consCmdHistoryEnd-2;
    if (curptr<0) curptr = COMMAND_HISTORY + curptr;
    for (backCount=0; curptr!=consCmdHistoryStart && backCount!=depth; curptr--) {
      if (curptr<0) curptr = COMMAND_HISTORY -1;
      if (consCmdHistory[curptr] == '\0') backCount++;
      }
    if (curptr != consCmdHistoryStart) curptr = curptr + 2;
    if (consCmdHistory[curptr] == '\0') {
      curptr++;
      if (curptr==COMMAND_HISTORY) curptr = 0;
      }
    if (depth > backCount) depth = backCount;
    // copy it to the buffer
    for (n=0; consCmdHistory[curptr]!='\0'; curptr++, n++) {
      if (curptr == COMMAND_HISTORY) curptr = 0;
      histBuffer[n] = consCmdHistory[curptr];
    }
    histBuffer[n] = '\0';
  }
  return (histBuffer);
} 
 
 
void cmdAppendHistory (char* command)
{ 
  static bool wrapped = false;              // is end expected to be < start
  uint16_t cmdLimit = strlen(command) + 1;  // include the null terminator
  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s cmdAppendHistory(%s)\r\n", getTimeStamp(), command);
    xSemaphoreGive(consoleSem);
  }
  if (cmdLimit <= 1 || strcmp(command, "history") == 0) return;
  for (uint16_t inPtr=0; inPtr<cmdLimit; inPtr++) {
    consCmdHistory[consCmdHistoryEnd++] = command[inPtr];
    if (consCmdHistoryEnd >= COMMAND_HISTORY) {
      consCmdHistoryEnd = 0;
      wrapped = true;
      }
    if (consCmdHistoryEnd == consCmdHistoryStart) {
      while (consCmdHistory[consCmdHistoryStart] != '\0' || ((wrapped && consCmdHistoryStart <= consCmdHistoryEnd) || ((!wrapped) && consCmdHistoryStart >= consCmdHistoryEnd))) {
        consCmdHistoryStart++;
        if (consCmdHistoryStart == COMMAND_HISTORY) {
          consCmdHistoryStart = 0;
          wrapped = false;
        }
      }
    }
  }
} 
 


void serialConsole(void *pvParameters)
// This is the console task.
{
  (void) pvParameters;
  char* oldCommand = NULL;
  uint8_t inChar;
  uint8_t escapeMode = 0;
  //uint8_t bufferPtr = 0;
  uint8_t inpPtr = 0;
  uint8_t endPtr = 0;
  char inBuffer[BUFFSIZE];
  char onHoldBuffer[BUFFSIZE];
  static char telnetOffer[] = { 255, 251, 1, 255, 251, 3}; // will echo, will suppress go-ahead, default other settings to won't / dn't
  uint8_t histDepth=0;

  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s serialConsole(NULL)\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }
 
  if (consCmdHistory == NULL) {
    consCmdHistory = (char*) malloc (COMMAND_HISTORY);
    }
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s Console ready\r\n", getTimeStamp());
    Serial.printf ("Type \"help\" or \"help summary\" or \"help <command>\" for more information.\r\n\r\n");
    xSemaphoreGive(consoleSem);
  }
  // Serial.print ("> ");
  while ( true ) {
    if (Serial.available()) {
      inChar = Serial.read();
      if (escapeMode == 0 && (inChar==8 || inChar == 127)) {
        if (inpPtr > 0) {
          inpPtr--;
          endPtr--;
          for (int n=inpPtr; n<endPtr; n++) inBuffer[n] = inBuffer[n+1];
          // inBuffer[endPtr] = '\0';
          Serial.printf ("%c", (char) 8);
          saveCursorPosition();
          for (int n=inpPtr; n<endPtr; n++) Serial.printf("%c", inBuffer[n]);
          Serial.printf (" ");
          restoreCursorPosition();
        }
      }
      else {
        if (inChar == '\n' || inChar == '\r') {
          inBuffer[endPtr] = '\0'; // Terminate string
          cmdGetHistoryLine (0, true);
          if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
            Serial.println ("");
            xSemaphoreGive(consoleSem);
          }
          if (endPtr>0) {
            inBuffer[endPtr] = '\0';
            cmdAppendHistory (inBuffer);
            processSerialCmd (inBuffer);
            //bufferPtr = 0;
            inpPtr = 0;
            endPtr = 0;
          }
          // Serial.print ("> ");
        }
        if (inChar == 27 || escapeMode > 0) {
          //
          // process escape chars before displaying anything
          //
          if (inChar == 27) escapeMode = 1;
          else if (inChar == 0x9b) escapeMode = 2; // CSI code = same as ESC [
          else if (escapeMode == 1 && inChar == '[') escapeMode = 2;
          else if (escapeMode == 2 || (escapeMode == 1 && (inChar=='h' || inChar=='j' || inChar=='k' || inChar=='l'))) {
            escapeMode = 0;
            switch (inChar) {
              case 'A':   // back 1 command
              case 'k':
                if (histDepth == 0) {
                  inBuffer[endPtr] = '\0';
                  strcpy (onHoldBuffer, inBuffer);
                }
                histDepth++;
                oldCommand = cmdGetHistoryLine (1, false);
                strcpy (inBuffer, oldCommand);
                for (uint16_t n=0; n< inpPtr; n++) Serial.printf("%c", (char) 8);
                Serial.printf ("%s", inBuffer);
                erase2eol();
                inpPtr = strlen (inBuffer);
                endPtr = inpPtr;
                break;
              case 'B':  // forward 1 command
              case 'j':
                if (histDepth > 0) {
                  histDepth--;
                  oldCommand = cmdGetHistoryLine (-1, false);
                  if (oldCommand == NULL || histDepth < 0) histDepth = 0;
                  if (histDepth == 0) strcpy (inBuffer, onHoldBuffer);
                  else strcpy (inBuffer, oldCommand);
                  for (uint16_t n=0; n< inpPtr; n++) Serial.printf("%c", (char) 8);
                  Serial.printf ("%s", inBuffer);
                  erase2eol();
                  inpPtr = strlen (inBuffer);
                  endPtr = inpPtr;
                  }
                break;
              case 'C':   // cursor right
              case 'l':
                if (inpPtr<endPtr) {
                  Serial.printf("%c", (char) inBuffer[inpPtr]);
                  inpPtr++;
                  }
                break;
              case 'D':   // cursor left
              case 'h':
                if (inpPtr>0) {
                  Serial.printf ("%c", (char) 8);
                  inpPtr--;
                  }
                break;
              case 'H':   // home
              case '~':
                for (uint16_t n = 0; n<inpPtr; n++) Serial.printf ("%c", (char) 8);
                inpPtr = 0;
                break;
              case 'F':   // end
                 for (;inpPtr < endPtr; inpPtr++) Serial.printf("%c", (char) inBuffer[inpPtr]);
                 break;
              default:
                break;
              }
            }
          else escapeMode = 0;
          //
          // Write to terminal
          //
          }
        else if (endPtr < (BUFFSIZE - 1) && inChar>= ' ' && inChar < 127) {
          for (int n=endPtr; n>inpPtr; n--) inBuffer[n]=inBuffer[n-1];
          inBuffer[inpPtr++] = inChar;
          endPtr++;
          Serial.printf ("%c", inChar);
          if (endPtr != inpPtr) {
            saveCursorPosition();
            if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
              for (int n=inpPtr; n<endPtr; n++) Serial.printf("%c", inBuffer[n]);
              xSemaphoreGive(consoleSem);
            }
            restoreCursorPosition();
          }
        }  // end of write to terminal
      } 
    }  // end of char avail
    delay(10);
  }    // end of while true
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s All console services stopping\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }
  vTaskDelete( NULL );
}

void processSerialCmd (char *inBuffer)
{
  char   *param[MAXPARAMS];
  uint8_t nparam;
  uint8_t n;
  bool inSpace = false;

  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s processSerialCmd(%s)\r\n", getTimeStamp(), inBuffer);
    xSemaphoreGive(consoleSem);
  }

  #ifdef FILESUPPORT
  if (writingFile) {
    if (strcmp ((char *)inBuffer, ".") == 0) util_closeWriteFile();
    else util_appendWriteFile((char *)inBuffer);
    return;
  }
  #endif
  param[0] = (char*) &inBuffer[0];
  for (n=0, nparam=1; n<BUFFSIZE && inBuffer[n]!= '\0' && nparam<MAXPARAMS; n++) {
    if (inBuffer[n]<=' ') {
      inBuffer[n] = '\0';
      inSpace = true;
    }
    else if (inSpace) {
      inSpace = false;
      param[nparam++] = (char*) &inBuffer[n];
    }
  }
  for (n=nparam; n<MAXPARAMS; n++) param[n] = NULL;
  if (strlen(param[0]) == 0) return;
  else if (nparam>=4 && strcmp (param[0], "add") == 0)           mt_add_gadget       (nparam, param);
  #ifdef BACKLIGHTPIN
  #ifndef BACKLIGHTREF
  else if (nparam<=2 && strcmp (param[0], "backlight") == 0)     mt_set_backlight    (nparam, param);
  #endif
  #endif
  #ifdef BRAKEPRESPIN
  else if ((nparam==1 || nparam==3) && strcmp (param[0], "brake") == 0) mt_brake     (nparam, param);
  #endif
  else if (nparam==1 && strcmp (param[0], "config")  == 0)       mt_sys_config       ();
  else if (nparam<=2 && strcmp (param[0], "cpuspeed") == 0)      mt_set_cpuspeed     (nparam, param);
  else if (nparam<=2 && strcmp (param[0], "debouncetime") == 0)  mt_set_debounceTime (nparam, param);
  else if (nparam<=2 && strcmp (param[0], "debug") == 0)         mt_set_debug        (nparam, param);
  else if (nparam==3 && (strcmp (param[0], "del") == 0 || strcmp (param[0], "delete") == 0)) mt_del_gadget (nparam, param);
  else if (nparam<=2 && strcmp (param[0], "detentcount") == 0)   mt_set_detentCount  (nparam, param);
  #ifdef USEWIFI
  else if (nparam==1 && strcmp (param[0], "diag") == 0)          startDiagPort();
  #endif
  else if (nparam<=2 && strcmp (param[0], "dump") == 0)          mt_dump_data        (nparam, (const char**) param);
  else if (nparam==1 && strcmp (param[0], "export") == 0)        mt_export           ();
  #ifdef FILESUPPORT
  else if (nparam==3 && strcmp (param[1], "del")   == 0 && strcmp (param[0], "file") == 0) util_deleteFile (SPIFFS, param[2]);
  else if (nparam==2 && strcmp (param[1], "dir")   == 0 && strcmp (param[0], "file") == 0) util_listDir    (SPIFFS, "/", 0);
  else if (nparam==3 && strcmp (param[1], "list")  == 0 && strcmp (param[0], "file") == 0) util_readFile   (SPIFFS, param[2], false);
  else if (nparam==3 && strcmp (param[1], "replay")== 0 && strcmp (param[0], "file") == 0) util_readFile   (SPIFFS, param[2], true);
  else if (nparam==3 && strcmp (param[1], "write") == 0 && strcmp (param[0], "file") == 0) util_writeFile  (SPIFFS, param[2]);
  #endif
  #ifdef USEWIFI
  #ifndef NOHTTPCLIENT
  else if (nparam==4 && strcmp (param[1], "download") == 0 && strcmp (param[0], "file") == 0) getHttp2File (SPIFFS, param[2], param[3]);
  #endif
  #endif
  #ifndef NODISPLAY
  else if (nparam<=2 && strcmp (param[0], "font") == 0)          mt_set_font         (nparam, param);
  #endif
  else if (nparam<=2 && strcmp (param[0], "help") == 0)          help                (nparam, param);
  else if (nparam==1 && strcmp (param[0], "history") == 0)       cmdGetHistory       ();
  else if (nparam==2 && strcmp (param[0], "kill") == 0)          runAutomation::killProc(param[1]);
  #ifdef USEWIFI
  else if (nparam<=2 && strcmp (param[0], "mdns") == 0)          set_mdns            (nparam, param);
  #endif
  else if (nparam==1 && strcmp (param[0], "memory") == 0)        showMemory          ();
  else if (nparam<=2 && strcmp (param[0], "name") == 0)          mt_set_name         (nparam, param);
  else if (nparam<=2 && strcmp (param[0], "nvs") == 0)           mt_dump_nvs         (nparam, param);
  #ifdef OTAUPDATE
  else if (nparam<=2 && strcmp (param[0], "ota") == 0)           mt_ota              (nparam, param);
  #endif
  else if (nparam==1 && strcmp (param[0], "pins")  == 0)         showPinConfig       ();
  else if (nparam==1 && strcmp (param[0], "procs")  == 0)        runAutomation::listProcs ();
  #ifndef SERIALCTRL
  else if (nparam<=2 && strcmp (param[0], "protocol") == 0)      mt_set_protocol     (nparam, param);
  #endif
  else if (nparam==1 && strcmp (param[0], "restart") == 0)       mt_sys_restart      ("command line request");
  else if (nparam<=2 && strcmp (param[0], "routedelay") == 0)    mt_set_routedelay   (nparam, param);
  #ifdef SCREENROTATE
  else if (nparam<=2 && strcmp (param[0], "rotatedisplay") == 0) mt_set_rotateDisp   (nparam, param);
  #endif
  else if (nparam>=2 && strcmp (param[0], "rpn") == 0)           (new runAutomation)->rpn  (nparam, param);
  else if (nparam==2 && strcmp (param[0], "run") == 0)           runAutomation::runbg (param[1]);
  #ifndef SERIALCTRL
  else if (nparam<=4 && strcmp (param[0], "server") == 0)        mt_set_server       (nparam, param);
  #endif
  else if ((nparam==1 || nparam>=3) && strcmp (param[0], "set") == 0) mt_set         (nparam, param);
  else if (nparam>=2 && strcmp (param[0], "sendcmd") == 0)       mt_sendcmd          (nparam, param);
  else if (nparam<=2 && strcmp (param[0], "speedstep") == 0)     mt_set_speedStep    (nparam, param);
  #ifdef WARNCOLOR
  else if (nparam<=2 && strcmp (param[0], "warnspeed") == 0)     mt_set_warnspeed    (nparam, param);
  #endif
  #ifdef WEBLIFETIME
  else if (nparam<=2 && strcmp (param[0], "webuser") == 0)       mt_set_webuser      (nparam, param);
  else if (nparam<=2 && strcmp (param[0], "webpass") == 0)       mt_set_webpass      (nparam, param);
  #endif
  #ifdef USEWIFI
  else if (nparam<=4 && strcmp (param[0], "wifi") == 0)          mt_set_wifi         (nparam, param);
  else if (nparam<=2 && strcmp (param[0], "wifimode") == 0)      mt_set_wifimode     (nparam, param);
  else if (nparam<=2 && strcmp (param[0], "wifiscan") == 0)      mt_set_wifiscan     (nparam, param);
  #endif
  else if (nparam==1 && strcmp (param[0], "locos") == 0)         displayLocos        ();
  else if (nparam==2 && strcmp (param[0], "trace") == 0)         runAutomation::traceProc(param[1]);
  else if (nparam==1 && strcmp (param[0], "turnouts") == 0)      displayTurnouts     ();
  else if (nparam==1 && strcmp (param[0], "partitions") == 0)    displayPartitions   ();
  else if (nparam==1 && strcmp (param[0], "showpackets")     == 0) showPackets    = true;
  else if (nparam==1 && strcmp (param[0], "noshowpackets")   == 0) showPackets    = false;
  #ifndef SERIALCTRL
  else if (nparam==1 && strcmp (param[0], "showkeepalive")   == 0) showKeepAlive  = true;
  else if (nparam==1 && strcmp (param[0], "noshowkeepalive") == 0) showKeepAlive  = false;
  #endif
  #ifdef WEBLIFETIME
  else if (nparam==1 && strcmp (param[0], "showweb")         == 0) showWebHeaders = true;
  else if (nparam==1 && strcmp (param[0], "noshowweb")       == 0) showWebHeaders = false;
  #endif
  else if (nparam==1 && strcmp (param[0], "showkeypad")      == 0) showKeypad     = true;
  else if (nparam==1 && strcmp (param[0], "noshowkeypad")    == 0) showKeypad     = false;
  else if (nparam==1 && strcmp (param[0], "bidirectional")   == 0) mt_setbidirectional (true);
  else if (nparam==1 && strcmp (param[0], "nobidirectional") == 0) mt_setbidirectional (false);
  else if (nparam==1 && strcmp (param[0], "sortdata")        == 0) nvs_put_int    ((char*) "sortData", 1);
  else if (nparam==1 && strcmp (param[0], "nosortdata")      == 0) nvs_put_int    ((char*) "sortData", 0);
  else if (nparam==1 && strcmp (param[0], "buttonstop")      == 0) nvs_put_int    ((char*) "buttonStop", 1);
  else if (nparam==1 && strcmp (param[0], "nobuttonstop")    == 0) nvs_put_int    ((char*) "buttonStop", 0);
  else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT))   == pdTRUE) {
    Serial.println ("Command not recognised.");
    xSemaphoreGive(consoleSem);
  }
}

// Use for seting any known NVS (Non Volatile Storage) variable to a value
// Expect to use nvs as the get equivalent to read NVS
void mt_set (int nparam, char **param)
{
  uint8_t limit = sizeof(nvsVars) / sizeof(nvsVar_s);
  bool notFound = true;

  if (nparam == 1) {
    char msgBuffer[BUFFSIZE];
    int val;
    for (uint8_t n=0; n<limit; n++) {
      if (nvsVars[n].varType==INTEGER) {
        val = nvs_get_int (nvsVars[n].varName, nvsVars[n].numDefault);
        if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
          Serial.printf ("set %-15s %d\r\n", nvsVars[n].varName, val);
          xSemaphoreGive(consoleSem);
        }
      }
      else if (nvsVars[n].varType==STRING) {
        nvs_get_string (nvsVars[n].varName, msgBuffer, nvsVars[n].strDefault, sizeof(msgBuffer));
        if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
          Serial.printf ("set %-15s %s\r\n", nvsVars[n].varName, msgBuffer);
          xSemaphoreGive(consoleSem);
        }
      }
    }
    return;
  }
  // we are setting something
  // first check if it is a shared register
  if (strncmp (param[1], "shreg", 3) == 0 && param[1][5]>='0' && param[1][5]<='9' && param[1][6] == '\0') {
    float temp = (new runAutomation())->rpn (nparam-2, &param[2]);
    int8_t i = param[1][5] - '0';
    notFound = false;
    if (xSemaphoreTake(procSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      sharedRegister[i] = temp;
      xSemaphoreGive(procSem);
    }
  }
  // if not found it will be an eeprom setting
  for (uint8_t n=0; n<limit && notFound; n++) {
    if (strcmp (param[1], nvsVars[n].varName) == 0) {
      notFound = false;
      if (nvsVars[n].varType == INTEGER) {
        if (nparam==3 && util_str_isa_int (param[2])) {
          int val = util_str2int(param[2]);
          if (val>=nvsVars[n].varMin && val<=nvsVars[n].varMax) nvs_put_int (param[1], val);
          else {
            if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
              Serial.printf ("Integer variable \"%s\" should be between %d and %d\r\n", param[1], nvsVars[n].varMin, nvsVars[n].varMax);
              xSemaphoreGive(consoleSem);
            }
          }
        }
        else {
          if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
            Serial.printf ("Integer variable \"%s\" should have one numeric value\r\n", param[1]);
            xSemaphoreGive(consoleSem);
          }
        }
      }
      else if (nvsVars[n].varType == STRING) {
        char msgBuffer[BUFFSIZE];
        strcpy (msgBuffer, param[2]);
        for (uint8_t n=3; n<nparam; n++) {
          strcat (msgBuffer, " ");
          strcat (msgBuffer, param[n]);
        }
        if (strlen(msgBuffer) >= nvsVars[n].varMin && strlen(msgBuffer) <= nvsVars[n].varMax) nvs_put_string (param[1], msgBuffer);
        else {
          if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
            Serial.printf ("String variable \"%s\" should be between %d and %d chars long\r\n", param[1], nvsVars[n].varMin, nvsVars[n].varMax);
            xSemaphoreGive(consoleSem);
          }
        }
      }
    }
  }
  if (notFound) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("Variable \"%s\" not valid using set command\r\n", param[1]);
      xSemaphoreGive(consoleSem);
    }
  }
}

#ifdef BRAKEPRESPIN
void mt_brake (int nparam, char **param)
{
  if (nparam==1) {
    int brakeup = nvs_get_int ( "brakeup", 1);
    int brakedown = nvs_get_int ("(char*) brakedown", 20);
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.print ("brake-up = ");
      Serial.print (brakeup);
      Serial.print (", brake-down = ");
      Serial.println (brakedown);
      xSemaphoreGive(consoleSem);
    }
  }
  else if (nparam == 3) {
    if (util_str_isa_int(param[1]) && util_str_isa_int(param[2])) {
      int val = util_str2int(param[1]);
      if (val > 0 && val<10) nvs_put_int ( "brakeup", val);
      val = util_str2int(param[2]);
      if (val > 0 && val<100) nvs_put_int ( "brakedown", val);
    }
    else {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("brake-up and brake-down values should both be integer");
        xSemaphoreGive(consoleSem);
      }
    }
  }
}
#endif

