enfieldcat/ESP32_miniThrottle/serialTerm.ino
// Only support backlight if there is a backlight pin without a backlight ADC reference
#ifdef BACKLIGHTPIN
#ifndef BACKLIGHTREF
void mt_set_backlight (int nparam, char **param)
{
  uint16_t val = 200;
  if (nparam==1) {
    val = nvs_get_int ( "backlightValue", 200);
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("backlight = %d\r\n", val);
      xSemaphoreGive(consoleSem);
    }
  }
  else {
    if (util_str_isa_int(param[1])) {
      val = util_str2int(param[1]);
      if (val>=0 && val<=255) {
        backlightValue = val;
        nvs_put_int ( "backlightValue", backlightValue);
        ledcWrite(0, backlightValue);
      }
      else {
        if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
          Serial.println ("backlight value should be less than 256");
          xSemaphoreGive(consoleSem);
        }
      }
    }
    else {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("backlight value should be less than 256");
        xSemaphoreGive(consoleSem);
      }
    }
  }
}
#endif
#endif

/*
 * Export config data
 */
void mt_export()
{
  const char *namespaces[] = {"loco", "turnout", "route"};
  int count;
  int limit = sizeof(nvsVars) / sizeof(nvsVar_s);
  char *nvsData, *nvsPtr;
  char varName[16];
  char msgBuffer[BUFFSIZE];
  bool differs = true;

  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.println ("#");
    Serial.println ("# MiniThrottle export");
    Serial.println ("#");
    Serial.println ("###########################");
    Serial.println ("#");
    Serial.println ("# Delete any security information like WiFi passwords before posting to web");
    Serial.print   ("# Software Vers: ");
    Serial.print   (PRODUCTNAME);
    Serial.print   (" ");
    Serial.println (VERSION);
    Serial.print   ("# Compile time:  ");
    Serial.print   (__DATE__);
    Serial.print   (" ");
    Serial.println (__TIME__);
    Serial.print   ("# Display Type:  ");
    #ifdef NODISPLAY
    Serial.println ("No Display");
    #else
    Serial.println (DISPLAYNAME);
    #endif
    #ifdef SERIALCTRL
    Serial.println ("# Direct serial connection to DCC-Ex");
    #endif
    Serial.println ("#");
    Serial.println ("###########################");
    Serial.println ("#");
    nvs_get_string ("tname", msgBuffer, "none", sizeof(msgBuffer));
    if (strcmp (msgBuffer, "none") != 0) Serial.printf ("name %s\r\n", msgBuffer);
    count = nvs_get_int ( "cpuspeed", -1);
    if (count>0) Serial.printf ("cpuspeed %d\r\n", count);
    count = nvs_get_int ( "detentCount", -1);
    if (count >= 0) Serial.printf ("detentcount %d\r\n", count);
    count = nvs_get_int ( "debounceTime", -1);
    if (count >= 0) Serial.printf ("debouncetime %d\r\n", count);
    count = nvs_get_int ( "routeDelay", -1);
    if (count >= 0) Serial.printf ("routedelay %d\r\n", count);
    count = nvs_get_int ( "speedStep", -1);
    if (count >= 0) Serial.printf ("speedstep %d\r\n", count);
    count = nvs_get_int ( "brakeup", -1);
    if (count >= 0 || nvs_get_int ("brakedown", -1) >= 0){
      Serial.printf ("brake %d %d\r\n", nvs_get_int ("brakeup", 1), nvs_get_int ("brakedown", 20));
    }
    count = nvs_get_int ( "sortData", -1);
    if (count == 0) Serial.println ("nosortdata");
    else if (count == 1) Serial.println ("sortdata");
    count = nvs_get_int ( "bidirectional", -1);
    if (count == 0) Serial.println ("nobidirectional");
    else if (count == 1) Serial.println ("bidirectional");
    #ifndef NODISPLAY
    count = nvs_get_int ( "fontIndex", -1);
    if (count > -1) Serial.printf ("font %d\r\n", count);
    #endif
    #ifdef SCREENROTATE
    count = nvs_get_int ( "screenRotate", -1);
    if (count > -1) Serial.printf ("rotatedisplay %d\r\n", count);
    #endif
    count = nvs_get_int ( "warnspeed", -1);
    if (count > -1) Serial.printf ("warnspeed %d\r\n", count);
    count = nvs_get_int ( "buttonStop", -1);
    if (count > -1) {
      if (count == 0) Serial.printf ("no");
      Serial.printf ("buttonstop\r\n");
    }
    #ifdef USEWIFI
    count = nvs_get_int ( "mdns", -1);
    if (count > -1) {
      Serial.printf ("mdns o");
      if (count == 0) Serial.printf ("ff\r\n");
      else Serial.printf ("n\r\n");
    }
    count = nvs_get_int ( "defaultProto", -1);
    if (count >= 0) {
      Serial.print ("protocol ");
      if (count == WITHROT) Serial.println ("withrottle");
      else Serial.println ("dccex");
    }
    for (uint8_t n=0; n<WIFINETS; n++) {
      sprintf (varName, "wifissid_%d", n);
      nvs_get_string (varName, msgBuffer, "none", sizeof(msgBuffer));
      if (strcmp (msgBuffer, "none") != 0) {
        Serial.printf ("wifi %d %s", n, msgBuffer);
        sprintf (varName, "wifipass_%d", n);
        nvs_get_string (varName, msgBuffer, "none", sizeof(msgBuffer));
        if (strcmp (msgBuffer, "none") != 0) Serial.printf (" %s\r\n", msgBuffer);
        else Serial.printf ("\r\n");
      }
    }
    for (uint8_t n=0; n<WIFINETS; n++) {
      sprintf (varName, "server_%d", n);
      nvs_get_string (varName, msgBuffer, "none", sizeof(msgBuffer));
      if (strcmp (msgBuffer, "none") != 0) {
        sprintf (varName, "port_%d", n);
        count = nvs_get_int (varName, 1080);
        Serial.printf ("server %d %s %d\r\n", n, msgBuffer, count);
      }
    }
    #endif
    xSemaphoreGive(consoleSem);
  }
  for (uint8_t n=0; n<3; n++) {
    count = nvs_count ((char*)namespaces[n], "all");
    if (count > 0) {
      nvsData = (char*) nvs_extractStr ((char*)namespaces[n], count, BUFFSIZE);
      nvsPtr = nvsData;
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        for (int j=0; j<count; j++) {
          Serial.print ("add ");
          Serial.print (namespaces[n]);
          Serial.print (" ");
          Serial.print (nvsPtr);
          Serial.print (" ");
          nvsPtr += 16;
          Serial.println (nvsPtr);
          nvsPtr += BUFFSIZE;
        }
        xSemaphoreGive(consoleSem);
      }
      free (nvsData);
    }
  }
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.print ("\r\n\r\n#\r\n# The following set commands complement CLI commands above to complete configuration\r\n#\r\n");
    xSemaphoreGive(consoleSem);
  }
  for (uint8_t n=0; n<limit; n++) {
    if (nvsVars[n].varType == INTEGER) {
      count = nvs_get_int (nvsVars[n].varName, nvsVars[n].numDefault);
      if (count != nvsVars[n].numDefault && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.printf ("# %s (min=%d, max=%d, default=%d)\r\n", nvsVars[n].varDesc, nvsVars[n].varMin, nvsVars[n].varMax, nvsVars[n].numDefault);
        Serial.printf ("set %s %d\r\n", nvsVars[n].varName, count);
        xSemaphoreGive(consoleSem);
      }
    }
    else if (nvsVars[n].varType == STRING) {
      nvs_get_string (nvsVars[n].varName, msgBuffer, nvsVars[n].strDefault, sizeof(msgBuffer));
      if (strcmp (msgBuffer, nvsVars[n].strDefault) == 0 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.printf ("# %s (default: \"%s\")\r\n", nvsVars[n].varDesc, nvsVars[n].strDefault);
        Serial.printf ("set %s %s\r\n", nvsVars[n].varName, msgBuffer);
        xSemaphoreGive(consoleSem);
      }
    }
  } 
}

