enfieldcat/ESP32_miniThrottle/serialTerm.ino
// draw a line 75 chars wide
void mt_ruler (char* title)
{
  uint8_t cntr = 75;

  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("\r\n");
    if (title != NULL) {
      cntr = 70 - strlen(title);
      Serial.printf ("--- %s ", title);
      }
    for (uint8_t n=0; n<cntr; n++) Serial.printf ("-");
    Serial.printf ("\r\n");
    xSemaphoreGive(consoleSem);
  }
}

void displayPartitions()
{
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    printf("Mem Partitions:\r\n");
    Serial.printf("+------+-----+----------+----------+------------------+\r\n");
    Serial.printf("| Type | Sub | Offset   | Size     | Label            |\r\n");
    Serial.printf("+------+-----+----------+----------+------------------+\r\n");
    for (uint8_t part_type=0 ; part_type<2; part_type++) {
      const char descr[][4] = {"APP", "DAT"};
      const esp_partition_type_t ptype[] = { ESP_PARTITION_TYPE_APP, ESP_PARTITION_TYPE_DATA };
      // esp_partition_iterator_t pi = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
      esp_partition_iterator_t pi = esp_partition_find (ptype[part_type], ESP_PARTITION_SUBTYPE_ANY, NULL);
      // esp_partition_find(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, NULL);
      if (pi != NULL) {
        do {
          const esp_partition_t* p = esp_partition_get(pi);
          Serial.printf("| %-4s | %02x  | 0x%06X | 0x%06X | %-16s |\r\n",
            descr[part_type], p->subtype, p->address, p->size, p->label);
        } while (pi = (esp_partition_next(pi)));
      }
    }
  Serial.printf("+------+-----+----------+----------+------------------+\r\n");
    xSemaphoreGive(consoleSem);
  }
}


void mt_sys_restart (const char *reason) // restart the throttle
{
  int maxLocoArray = locomotiveCount + MAXCONSISTSIZE;

  setDisconnected();
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("Restarting system: %s\r\n", reason);
    xSemaphoreGive(consoleSem);
  }
  for (uint8_t n=0; n<maxLocoArray; n++) if (locoRoster[n].owned) {
    setLocoSpeed (n, 0, STOP);
    setLocoOwnership (n, false);
    if (cmdProtocol==DCCEX) {
      locoRoster[n].owned = false;
    }
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("-> Stopping loco: %s\r\n", locoRoster[n].name);
      xSemaphoreGive(consoleSem);
    }
  }
  #ifdef USEWIFI
  if (diagIsRunning && xSemaphoreTake(diagPortSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    diagEnqueue ('e', (char*) "### Restart: ", false);
    if (reason!=NULL) diagEnqueue ('e', (char*) reason, true);
    else diagEnqueue ('e', (char*) "Unknown cause.", true);
    xSemaphoreGive(diagPortSem);
    delay(1000); // allow time for message to be processed
  }
  #endif
  esp_restart();  
}

void mt_set_detentCount (int nparam, char **param) //set count of clicks required on rotary encoder
{
  if (nparam == 1) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.print ("Detent Count  = ");
      Serial.println (nvs_get_int ("detentCount", 2));
      xSemaphoreGive(consoleSem);
    }
  }
  else {
    char *tptr;
    int count;
    count = strtol (param[1], &tptr, 10);
    if (count<1 || count>10) {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("Detent count should be between 1 and 10");
        xSemaphoreGive(consoleSem);
      }
    }
    else {
      nvs_put_int ("detentCount", count);
    }
  }
}

void mt_set_debounceTime (int nparam, char **param) //set count of clicks required on rotary encoder
{
  if (nparam == 1) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("Debounce time = %dmS\r\n", nvs_get_int ("debounceTime", DEBOUNCEMS));
      xSemaphoreGive(consoleSem);
    }
  }
  else {
    char *tptr;
    int count;
    count = strtol (param[1], &tptr, 10);
    if (count<1 || count>200) {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("Debounce time should be between 1 and 200");
        xSemaphoreGive(consoleSem);
      }
    }
    else {
      nvs_put_int ("debounceTime", count);
      if (configHasChanged) {
        if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
          Serial.println ("Change becomes effective on restart");
          xSemaphoreGive(consoleSem);
        }
      }
    }
  }
}

void mt_set_debug (int nparam, char **param) //set debug level
{
  if (nparam == 1) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("Debug Level = %d\r\n", nvs_get_int ("debuglevel", DEBOUNCEMS));
      xSemaphoreGive(consoleSem);
    }
  }
  else {
    char *tptr;
    int count;
    count = strtol (param[1], &tptr, 10);
    if (count<0 || count>3) {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("Debug level is between 0 (terse) and 3 (verbose)");
        xSemaphoreGive(consoleSem);
      }
    }
    else {
      nvs_put_int ("debuglevel", count);
      debuglevel = count;
      if (configHasChanged) {
        if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
          Serial.println ("Debug level becomes effective immediately and remains effective on restart");
          xSemaphoreGive(consoleSem);
        }
      }
    }
  }
}

#ifndef NODISPLAY
void mt_set_font (int nparam, char **param)  // set font
{
  uint8_t fontIndex;
  
  if (nparam == 1) {
    fontIndex = nvs_get_int ("fontIndex", 1);
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("Current font %d: %s\r\n", fontIndex, fontLabel[fontIndex]);
      Serial.println ("Font options are:");
      for (uint8_t n=0; n<sizeof(fontWidth); n++) {
        Serial.printf ("%d: %s (%dx%d chars)\r\n", n, fontLabel[n], (screenWidth/fontWidth[n]), (screenHeight/fontHeight[n]));
      }
      xSemaphoreGive(consoleSem);
    }
  }
  else {
    if (util_str_isa_int (param[1])) {
      fontIndex = util_str2int(param[1]);
      if (fontIndex >= 0 && fontIndex < sizeof(fontWidth)) {
        nvs_put_int ("fontIndex", fontIndex);
      }
      else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.printf ("Font index should be between 0 and %d\r\n", sizeof(fontWidth) - 1);
        xSemaphoreGive(consoleSem);
      }
    }
    else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("Font index should be between 0 and %d\r\n", sizeof(fontWidth) - 1);
      xSemaphoreGive(consoleSem);
    }
  }
}
#endif

