enfieldcat/ESP32_miniThrottle/serialTerm.ino
void mt_set_wifiscan(int nparam, char **param)
{
  int staConnect = 99;
  
  if (nparam==1) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.print ("wifi station scan mode: ");
      staConnect = nvs_get_int ("staConnect", 0);
      if (staConnect == 0) Serial.println ("list");
      else if (staConnect == 1) Serial.println ("strength");
      else Serial.println ("any");
      xSemaphoreGive(consoleSem);
      wifi_scanNetworks (true);
    }
  }
  else {
    if (strcmp (param[1], "list") == 0) staConnect = 0;
    else if (strcmp (param[1], "strength") == 0) staConnect = 1;
    else if (strcmp (param[1], "any") == 0) staConnect = 2;
    else {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("wifiscan should be list, strength or any");
        xSemaphoreGive(consoleSem);
      }
      return;
    }
    if (staConnect>=0 || staConnect<=2) nvs_put_int ("staConnect", staConnect);
  }
}

void set_mdns(int nparam, char **param)
{
  if (nparam==1) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.print ("mDNS lookup: O");
      if (nvs_get_int ("mdns", 1) == 1) Serial.println ("n");
      else Serial.println ("ff");
      xSemaphoreGive(consoleSem);
    }
  }
  else if (strcmp (param[1], "on") == 0) {
    nvs_put_int ("mdns", 1);
  }
  else if (strcmp (param[1], "off") == 0) {
    nvs_put_int ("mdns", 0);
  }
  else {
    if (param[1][0] != '_') {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("if searching for service prefix service name with \"_\".");
        xSemaphoreGive(consoleSem);
      }
    }
    mdnsLookup (param[1]);
  }
}

#ifdef OTAUPDATE
/*
 * Over the air update controls
 */
void mt_ota (int nparam, char **param)
{

  if (nparam==1 || strcmp(param[1], "status") == 0) {
    char *tPtr =  (char*) OTAstatus();
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.println (tPtr);
      xSemaphoreGive(consoleSem);
    }
  }
  else if (nparam==2) {
    if (strcmp(param[1], "update") == 0) if (OTAcheck4update(NULL))  mt_sys_restart ("Restarting to boot updated code.");
    else if (strcmp(param[1], "revert") == 0) if (OTAcheck4rollback(NULL)) mt_sys_restart ("Restarting to boot reverted code.");
    else if (strncmp(param[1], "http://", 7) == 0 || strncmp(param[1], "https://", 8) == 0) {
      nvs_put_string ("ota_url", param[1]);
    }
    else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.print ("ota parameter not understood: ");
      Serial.println (param[1]);
    }
  }
}
#endif

void mt_set_server (int nparam, char **param)  // set details about remote servers
{
  char *tptr;
  int  port;
  char host[65];
  char paramName[15];
  char outBuffer[80];
  
  if (nparam<=2) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("  Server Table:\r\n");
      Serial.printf ("+------+----------------------------------+-------+\r\n");
      Serial.printf ("|  Idx | Server                           |  Port |\r\n");
      Serial.printf ("+------+----------------------------------+-------+\r\n");
      for (uint8_t index=0; index<WIFINETS; index++) {
        sprintf (paramName, "server_%d", index);
        if (index==0) nvs_get_string (paramName, host, HOST, sizeof(host));
        else nvs_get_string (paramName, host, "none", sizeof(host));
        if (strcmp (host, "none") != 0) {
          sprintf (paramName, "port_%d", index);
          port = nvs_get_int (paramName, PORT);
          Serial.printf ("|%5d | %-32s | %5d |\r\n", index, host, port);
        }
        else if (nparam<2) Serial.printf ("|%5d | %-32s |       |\r\n", index, "none");
      }
      Serial.printf ("+------+----------------------------------+-------+\r\n");
      if (!wiCliConnected) {
        Serial.printf ("--- Server not connected ---\r\n");
      }
      xSemaphoreGive(consoleSem);
    }
  return;
  }
  /*
   * Update settings
   */
  int tlong = strtol ((const char*)param[1], &tptr, 10);
  // index = (uint8_t) tlong;
  if (tlong<0 || tlong >= (int) WIFINETS) {
    sprintf (outBuffer, "Server index must be between 0 and %d", (WIFINETS - 1));
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.println (outBuffer);
      xSemaphoreGive(consoleSem);
    }
    return;
  }
  if (strlen(param[2])>sizeof(host)-1) param[2][sizeof(host)-1] = '\0';
  sprintf (paramName, "server_%d", tlong);
  nvs_put_string (paramName, param[2]);
  sprintf (paramName, "port_%d", tlong);
  if (nparam < 4) {
    nvs_put_int (paramName, PORT);
  }
  else {
    tlong = strtol ((const char*)param[3], &tptr, 10);
    if (tlong < 1024 || tlong > 65530) tlong = PORT;
    nvs_put_int (paramName, tlong);
  }
  if (configHasChanged) Serial.println ("Change becomes effective on restart");
}

void mt_set_protocol(int nparam, char **param)
{
  if (nparam==1) {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.print ("Default protocol is ");
      if (nvs_get_int ("defaultProto", WITHROT) == WITHROT) Serial.println ("WiThrottle");
      else Serial.println ("DCC-Ex");
      xSemaphoreGive(consoleSem);
    }
  }
  else {
    if (strcmp (param[1], "withrot") == 0 || strcmp (param[1], "withrottle") == 0 || strcmp (param[1], "dccex") == 0) {
      if (strcmp (param[1], "withrot") == 0 || strcmp (param[1], "withrottle") == 0) nvs_put_int ("defaultProto", WITHROT);
      else nvs_put_int ("defaultProto", DCCEX);
    }
    else {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("protocol should be one of: withrot, dccex");
        xSemaphoreGive(consoleSem);
      }
    }
  }
}

void mt_set_wifimode(int nparam, char **param)
{
  uint8_t mode;

  if (nparam==1) {
    mode = nvs_get_int ("WiFiMode", defaultWifiMode);
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.print ("Default WiFi mode is ");
      if (mode == WIFIAP) Serial.println ("AP");
      else if (mode == WIFISTA) Serial.println ("STA");
      else Serial.println ("BOTH");
      xSemaphoreGive(consoleSem);
    }
  }
  else {
    if      (strcmp (param[1], "ap")   == 0) nvs_put_int ("WiFiMode", WIFIAP);
    else if (strcmp (param[1], "sta")  == 0) nvs_put_int ("WiFiMode", WIFISTA);
    else if (strcmp (param[1], "both") == 0) nvs_put_int ("WiFiMode", WIFIBOTH);
    else {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.println ("wifimode should be one of: ap, sta or both");
        xSemaphoreGive(consoleSem);
      }
    }
  }
}

#endif

#ifdef USEWIFI
void startDiagPort()
{
   xTaskCreate(diagPortMonitor, "diagPortMonitor", 4096, NULL, 4, NULL);
}
#endif

