enfieldcat/ESP32_miniThrottle/serialTerm.ino
void displayLocos()  // display locomotive data
{
  const static char dirIndic[3][5] = { "Fwd", "Stop", "Rev" };
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf   ("Locomotive Count = %d\r\n", locomotiveCount);
    if (locomotiveCount > 0 && locomotiveCount<255 && locoRoster!=NULL) {
      Serial.printf ("+--------+----------------------------------+------+-------+\r\n");
      Serial.printf ("| %6s | %-32s | %-4s | %s |\r\n", "ID", "Name", "Dir", "Speed");
      Serial.printf ("+--------+----------------------------------+------+-------+\r\n");
      for (uint8_t n=0; n<locomotiveCount; n++) {
        Serial.printf ("| %5d%c | %-32s | %-4s | %5d |\r\n", locoRoster[n].id, locoRoster[n].type, locoRoster[n].name, dirIndic[locoRoster[n].direction], locoRoster[n].speed);
      }
      Serial.printf ("+--------+----------------------------------+------+-------+\r\n");
    }
    else Serial.printf ("No locomotives defined.\r\n");
    xSemaphoreGive(consoleSem);
  }
}

void displayTurnouts()  // display known data about switches / points
{
  char stateBuffer[10];
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf  ("Turnout (switch/point) statuses = %d\r\n", turnoutStateCount);
    if (turnoutStateCount>0 && turnoutStateCount<255) {
      Serial.printf ("+------------+------------------+\r\n");
      Serial.printf ("|  ID        | State            |\r\n");
      Serial.printf ("+------------+------------------+\r\n");
      for (uint8_t n=0; n<turnoutStateCount; n++) {
        if (turnoutState[n].state <= 32 || turnoutState[n].state >= 127) sprintf (stateBuffer, "(0x%02x)", turnoutState[n].state);
        else sprintf (stateBuffer, "(%c)", turnoutState[n].state);
        Serial.printf ("| %3d %-6s | %-16s |\r\n", turnoutState[n].state, stateBuffer, turnoutState[n].name);
      }
      Serial.printf ("+------------+------------------+\r\n\n");
    }
    else Serial.printf ("No turnout statuses defined\r\n\n");
    Serial.printf  ("Turnout (switch/point) count = %d\r\n", turnoutCount);
    if (turnoutCount > 0 && turnoutCount<255 && turnoutList!=NULL) {
      Serial.printf ("+------------------+------------------+------------+\r\n");
      Serial.printf ("| %-16s | %-16s | %-10s |\r\n", "System-Name", "User-Name", "State");
      Serial.printf ("+------------------+------------------+------------+\r\n");
      for (uint8_t n=0; n<turnoutCount; n++) {
        if (turnoutList[n].state <= 32 || turnoutList[n].state >= 127) sprintf (stateBuffer, "(0x%02x)", turnoutList[n].state);
        else sprintf (stateBuffer, "(%c)", turnoutList[n].state);
        Serial.printf ("| %-16s | %-16s | %3d %-6s |\r\n", turnoutList[n].sysName, turnoutList[n].userName, turnoutList[n].state, stateBuffer);
      }
      Serial.printf ("+------------------+------------------+------------+\r\n");
    }
    else Serial.printf ("No turnouts defined\r\n");
    xSemaphoreGive(consoleSem);
  }
}

void displayRoutes()  // display known data about switches / points
{
  char outBuffer[80];
  char stateBuffer[10];
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.print   ("Route statuses = ");
    Serial.println (routeStateCount);
    if (routeStateCount>0 && routeStateCount<255 && routeState != NULL) {
      Serial.println ("   ID        | State");
      for (uint8_t n=0; n<routeStateCount; n++) {
        if (routeState[n].state <= 32 || routeState[n].state >= 127) sprintf (stateBuffer, "(0x%02x)", routeState[n].state);
        else sprintf (stateBuffer, "(%c)", routeState[n].state);
        sprintf (outBuffer, "  %3d %-6s | %s", routeState[n].state, stateBuffer, routeState[n].name);
        Serial.println (outBuffer);
      }
    }
    Serial.print   ("Routes count = ");
    Serial.println (routeCount);
    if (routeCount > 0 && routeCount<255 && routeList != NULL) {
      sprintf (outBuffer, "%-16s | %-16s | %s", "System-Name", "User-Name", "State");
      Serial.println (outBuffer);
      for (uint8_t n=0; n<routeCount; n++) {
        if (routeList[n].state <= 32 || routeList[n].state >= 127) sprintf (stateBuffer, "(0x%02x)", routeList[n].state);
        else sprintf (stateBuffer, "(%c)", routeList[n].state);
        sprintf (outBuffer, "%-16s | %-16s | %d %s", routeList[n].sysName, routeList[n].userName, routeList[n].state, stateBuffer);
        Serial.println (outBuffer);
      }
    }
    xSemaphoreGive(consoleSem);
  }
}

void mt_set_routedelay (int nparam, char **param)
{
  if (nparam == 1) {
    int dval = nvs_get_int("routeDelay", 2);
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.print ("Delay between switch changes when setting routes is option ");
      Serial.print (dval);
      Serial.print (" => ");
      Serial.print (routeDelay[dval]);
      Serial.println (" mS");
      Serial.println ("Options are");
      for (uint8_t n=0; n<(sizeof(routeDelay)/sizeof(uint16_t)); n++) {
        Serial.print ("   ");
        Serial.print (n);
        Serial.print (" => ");
        Serial.print (routeDelay[n]);
        Serial.println (" mS");
      }
      xSemaphoreGive(consoleSem);
    }
  }
  else {
    if (util_str_isa_int (param[1])) {
      int dval = util_str2int (param[1]);
      if (dval>=0 && dval<(sizeof(routeDelay)/sizeof(uint16_t))) {
        nvs_put_int ("routeDelay", dval);
      }
      else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.print ("routedelay value should be less than ");
        Serial.println (sizeof(routeDelay)/sizeof(uint16_t));
        xSemaphoreGive(consoleSem);
      }
    }
    else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.println ("routedelay value should be an integer");
      xSemaphoreGive(consoleSem);
    }
  }
}

void mt_setbidirectional (bool setting)
{
  bidirectionalMode = setting;
  if (setting) nvs_put_int ("bidirectional", 1);
  else nvs_put_int ("bidirectional", 0);
}



