enfieldcat/ESP32_miniThrottle/serialTerm.ino
#ifdef WARNCOLOR
void mt_set_warnspeed(int nparam, char **param)
{
  int warnspeed;
  
  if (nparam==1) {
    warnspeed = nvs_get_int((char*) "warnSpeed", 90);
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ((char*) " * Warn speed: %d%%\r\n", warnspeed);
      xSemaphoreGive(consoleSem);
    }
  }
  else if (util_str_isa_int (param[1])) {
    warnspeed = util_str2int(param[1]);
    if (warnspeed>=50 && warnspeed<=101) {
      nvs_put_int ( "warnSpeed", warnspeed);
    }
    else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ((char*) "Warning speed should be between 50 and 101%\r\n");
      xSemaphoreGive(consoleSem);
    }
  }
  else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ((char*) "Warning speed should be between 50 and 101%\r\n");
    xSemaphoreGive(consoleSem);
  }
}
#endif

bool showPinConfig()  // Display pin out selection
{
  #ifndef keynone
  uint8_t rows[] = { MEMBR_ROWS };
  uint8_t cols[] = { MEMBR_COLS };
  #endif
  char prtTemplate[16];
  uint8_t limit = sizeof(pinVars)/sizeof(pinVar_s);
  uint8_t maxWidth = 0;
  bool retVal = true;

  for (uint8_t n=0; n<limit; n++) if (maxWidth<strlen(pinVars[n].pinDesc) && strncmp(pinVars[n].pinDesc, "Internal ", 9)!=0) maxWidth = strlen(pinVars[n].pinDesc);
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.println ((char*) "Pin Reservation check:");
    sprintf (prtTemplate, "\t%%-%ds = EN\r\n", maxWidth);
    Serial.printf (prtTemplate, "Reset");
    sprintf (prtTemplate, "\t%%-%ds = %%2d", maxWidth);
    for (uint8_t n=0; n<limit; n++) if (strncmp(pinVars[n].pinDesc, "Internal ", 9)!=0) {
      Serial.printf (prtTemplate, pinVars[n].pinDesc, pinVars[n].pinNr);
      pinEquiv (pinVars[n].pinNr);
      for (uint8_t i=0; i<limit; i++) {
        if (i!=n && pinVars[n].pinNr == pinVars[i].pinNr && pinVars[n].pinNr!=-1) {
          retVal = false;
          Serial.printf (", Clash with \"%s\"", pinVars[i].pinDesc);
        }
      }
      #ifndef keynone
      for (uint8_t i=0; i<sizeof(rows); i++) {
        if (pinVars[n].pinNr == rows[i]) {
          retVal = false;
          Serial.printf (", Clash with Keypad-Row \"%d\"", rows[i]);
        }
      }
      for (uint8_t i=0; i<sizeof(cols); i++) {
        if (pinVars[n].pinNr == cols[i]) {
          retVal = false;
          Serial.printf (", Clash with Keypad-Column \"%d\"", cols[i]);
        }
      }
      #endif
      Serial.printf ("\r\n");
    }
    #ifdef keynone
    Serial.printf  ("No Keyboard Pins\r\n");
    #else
    Serial.printf ("\tKeyboard Rows (%d rows) = ", sizeof(rows));
    for (uint8_t n=0; n<sizeof(rows); n++) {
      if (n>0) Serial.print (", ");
      Serial.printf ("%2d", rows[n]);
      pinEquiv (rows[n]);
    }
    for (uint8_t n=0; n<sizeof(rows); n++) {
      for (uint8_t i=0; i<sizeof(rows); i++) if (i!=n && rows[i] == rows[n]) {
        retVal = false;
        Serial.printf (", row pin %d used twice", rows[n]);
      }
      for (uint8_t i=0; i<sizeof(cols); i++) if (cols[i] == rows[n]) {
        retVal = false;
        Serial.printf (", row pin %d also used as keypad column", rows[n]);
      }
    }
    Serial.println ("");
    Serial.printf ("\tKeyboard Cols (%d cols) = ", sizeof(cols));
    for (uint8_t n=0; n<sizeof(cols); n++) {
      if (n>0) Serial.print (", ");
      Serial.printf ("%2d", cols[n]);
      pinEquiv (cols[n]);
    }
    for (uint8_t n=0; n<sizeof(cols); n++) {
      for (uint8_t i=0; i<sizeof(cols); i++) if (i!=n && cols[i] == cols[n]) {
        retVal = false;
        Serial.printf (", column pin %d used twice", cols[n]);
      }
      for (uint8_t i=0; i<sizeof(rows); i++) if (rows[i] == cols[n]) {
        retVal = false;
        Serial.printf (", column pin %d also used as keypad row", cols[n]);
      }
    }
    Serial.println ("");
    #endif
    #ifdef LED_BUILTIN
    Serial.printf ("LED built in reported as: %d\r\n", LED_BUILTIN);
    #if LED_BUILTIN > MAXPINS
    #if ESPMODEL == ESP32S3
    Serial.printf ("LED built expected to be combo of: 48 + %d\r\n", (LED_BUILTIN - 48));
    #elif ESPMODEL == ESP32C3
    Serial.printf ("LED built expected to be combo of: 8 + %d\r\n", (LED_BUILTIN - 8));
    #else
    #ifdef SOC_GPIO_PIN_COUNT
    Serial.printf ("LED built expected to be combo of: %d + %d\r\n", SOC_GPIO_PIN_COUNT, (LED_BUILTIN - SOC_GPIO_PIN_COUNT));
    #endif    // SOC_GPIO_PIN_COUNT
    #endif    // ESPMODEL == ESP32S3
    #endif    // RLEDRGB_BUILTIN > MAXPINS
    #endif    // LED_BUILTIN
    xSemaphoreGive(consoleSem);
  }
  return (retVal);
}

void pinEquiv(uint8_t pin)
{
  switch (pin) {
  #if ESPMODEL == ESP32
    case 1:
      Serial.printf (" (Txd)");
      break;
    case 3:
      Serial.printf (" (Rxd)");
      break;
    case 17:
      Serial.printf (" (Txd2)");
      break;
    case 16:
      Serial.printf (" (Rxd2)");
      break;
    case 36:
      Serial.printf (" (SensVP)");
      break;
    case 39:
      Serial.printf (" (SensVN)");
      break;
  #elif ESPMODEL == ESP32C2
    case 20:
      Serial.printf (" (Txd)");
      break;
    case 19:
      Serial.printf (" (Rxd)");
      break;
  #elif ESPMODEL == ESP32C3
    case 20:
      Serial.printf (" (Txd)");
      break;
    case 21:
      Serial.printf (" (Rxd)");
      break;
  #elif ESPMODEL == ESP32S2
    case 43:
      Serial.printf (" (Txd)");
      break;
    case 44:
      Serial.printf (" (Rxd)");
      break;
  #elif ESPMODEL == ESP32S3
    case 43:
      Serial.printf (" (Txd)");
      break;
    case 44:
      Serial.printf (" (Rxd)");
      break;
  #endif
  }
}


void showMemory()
{
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.print   ("     Free Heap: "); Serial.print (util_ftos (ESP.getFreeHeap(), 0)); Serial.print (" bytes, "); Serial.print (util_ftos ((ESP.getFreeHeap()*100.0)/ESP.getHeapSize(), 1)); Serial.println ("%");
    Serial.print   (" Min Free Heap: "); Serial.print (util_ftos (ESP.getMinFreeHeap(), 0)); Serial.print (" bytes, "); Serial.print (util_ftos ((ESP.getMinFreeHeap()*100.0)/ESP.getHeapSize(), 1)); Serial.println ("%");
    Serial.print   ("     Heap Size: "); Serial.print (util_ftos (ESP.getHeapSize(), 0)); Serial.println (" bytes");
    if (ESP.getPsramSize() > 0) {
      Serial.print   ("    PSRAM Size: "); Serial.print (util_ftos (ESP.getPsramSize(), 0)); Serial.println (" bytes");
      Serial.print   ("    Free PSRAM: "); Serial.print (util_ftos (ESP.getFreePsram(), 0)); Serial.print (" bytes, "); Serial.print (util_ftos ((ESP.getFreePsram()*100.0)/ESP.getPsramSize(), 1)); Serial.println ("%");
    }
    Serial.print   ("NVS Free Space: "); Serial.print (nvs_get_freeEntries()); Serial.println (" x 32 byte blocks");
    Serial.print   ("        Uptime: "); Serial.print (util_ftos (esp_timer_get_time() / (uS_TO_S_FACTOR * 60.0), 2)); Serial.println (" mins");
    Serial.print   ("      CPU Freq: "); Serial.print (util_ftos (ESP.getCpuFreqMHz(), 0)); Serial.println (" MHz");
    Serial.print   ("  Crystal Freq: "); Serial.print (util_ftos (getXtalFrequencyMhz(), 0)); Serial.println (" MHz");
    #ifdef FILESUPPORT
    Serial.printf  ("   File System: %d bytes used of %d available (%s%% used)\r\n", SPIFFS.usedBytes(), SPIFFS.totalBytes(), util_ftos((float)(SPIFFS.usedBytes()*100)/(float)SPIFFS.totalBytes(), 2));
    #endif
    xSemaphoreGive(consoleSem);
  }
}

