enfieldcat/ESP32_miniThrottle/serialTerm.ino
void help(int nparam, char **param)  // show help data
{
  bool summary = false;
  bool all = false;

  if (nparam==2) {
    if (strcmp(param[1], "summary") == 0) {
      summary = true;
      all = true;
    }
    else if (strcmp(param[1], "all") == 0) all = true;
  }
  else all = true;
  if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.println ((const char*) "Running permanent settings without parameters prints current settings:");
    if (all || strcmp(param[1], "add")==0) {
      Serial.println ((const char*) "add loco <dcc-address> <description>");
      Serial.println ((const char*) "add turnout <name> {DCC|SERVO|VPIN} <dcc-definition>");
      Serial.println ((const char*) "add route <name> {<turnout-name> <state>} {<turnout-name> <state>}...");
      if (!summary) {
        Serial.println ((const char*) "    Add a locomotive, turnout or route to DCC-Ex roster");
        Serial.println ((const char*) "    where for turnouts, definitions may be:");
        Serial.println ((const char*) "       DCC <linear-address>");
        Serial.println ((const char*) "       DCC <address> <sub-address>");
        Serial.println ((const char*) "       SERVO <pin> <throw-posn> <closed-posn> <profile>");
        Serial.println ((const char*) "       VPIN <pin-number>");
        Serial.println ((const char*) "    Servo profile: 0=immediate, 1=0.5 secs, 2=1 sec, 3=2 secs, 4=bounce");
        Serial.println ((const char*) "    And where for routes, turn-out state is one of:");
        Serial.println ((const char*) "       C - Closed");
        Serial.println ((const char*) "       T - Thrown");
        Serial.println ((const char*) "    DCC-Ex only, restart required");
      }
    }
    #ifdef BACKLIGHTPIN
    #ifndef BACKLIGHTREF
    if (all || strcmp(param[1], "backlight")==0) {
      Serial.println ((const char*) "backlight [0-255]");
      if (!summary) {
        Serial.println ((const char*) "    Display backlight intensity setting");
      }
    }
    #endif
    #endif
    if (all || strcmp(param[1], "bidirectional")==0) {
      Serial.println ((const char*) "[no]bidirectional");
      if (!summary) {
        Serial.println ((const char*) "    turn bidirectional (AKA \"train set\") mode on/off as default setting");
      }
    }
    #ifdef BRAKEPRESPIN
    if (all || strcmp(param[1], "brake")==0) {
      Serial.println ((const char*) "brake [<up-rate> <down-rate>]");
      if (!summary) {
        Serial.println ((const char*) "    Set \"brake pressure\" increase and decrease");
        Serial.println ((const char*) "    Increase is constant rate over time");
        Serial.println ((const char*) "    Decrease is (1/n * pressure) per step decrease in speed");
      }
    }
    #endif
    if (all || strcmp(param[1], "buttonstop")==0) {
      Serial.println ((const char*) "[no]buttonstop");
      if (!summary) {
        Serial.println ((const char*) "    permit/prevents encoder button doing a stop operation when driving locos");
      }
    }
    if (all || strcmp(param[1], "config")==0) {
      Serial.println ((const char*) "config");
      if (!summary) {
        Serial.println ((const char*) "    Show current configuration settings");
      }
    }
    if (all || strcmp(param[1], "cpuspeed")==0) {
      // Serial.println ((const char*) "cpuspeed [{240|160|80|0}]");
      Serial.print   ((const char*) "cpuspeed [{240|160|80");
      #ifndef USEWIFI
      // Cannot use WiFi if using speeds of less than 80.
      switch ((int) getXtalFrequencyMhz()) {
        case 40: Serial.print ((const char*) "|40|20|10");
             break;
        case 26: Serial.print ((const char*) "|26|13");
             break;
        case 24: Serial.print ((const char*) "|24|12");
             break;
      }
      #endif
      Serial.println ((const char*) "|0}]");
      if (!summary) {
        Serial.println ((const char*) "    Set CPU speed in MHz, lower speeds conserve power but are less responsive");
        Serial.println ((const char*) "    Use zero to use speed selected at install time");
      }
    }
    if (all || strcmp(param[1], "debug")==0) {
      Serial.println ((const char*) "debug [<0-3>]");
      if (!summary) {
        Serial.println ((const char*) "    Set console message verboseness between 0 - terse, 3 - verbose");
      }
    }
    if (all || strcmp(param[1], "del")==0) {
      Serial.println ((const char*) "del {loco|turnout|route} <dcc-address|name>");
      if (!summary) {
        Serial.println ((const char*) "    Delete a locomotive or turnout from DCC-Ex roster");
        Serial.println ((const char*) "    DCC-Ex only, restart required");
      }
    }
    if (all || strcmp(param[1], "detentcount")==0) {
      Serial.println ((const char*) "detentcount [<n>]");
      if (!summary) {
        Serial.println ((const char*) "    Set the number or rotary encoder clicks per up/down movement");
      }
    }
    #ifdef USEWIFI
    if (all || strcmp(param[1], "diag")==0) {
      Serial.println ((const char*) "diag");
      if (!summary) {
        Serial.println ((const char*) "    Start diagnostic port if not already started");
        Serial.println ((const char*) "    temporary setting");
      }
    }
    #endif
    if (all || strcmp(param[1], "dump")==0) {
      Serial.println ((const char*) "dump {loco|turnout|turnoutstate|route|routestate}");
      if (!summary) {
        Serial.println ((const char*) "    Dump memory structures of objects");
      }
    }
    if (all || strcmp(param[1], "export")==0) {
      Serial.println ((const char*) "export");
      if (!summary) {
        Serial.println ((const char*) "    export commands required to replicate this throttle's configuration");
      }
    }
    #ifdef FILESUPPORT
    if (all || strcmp(param[1], "file")==0) {
      Serial.println ((const char*) "file dir");
      Serial.println ((const char*) "file del <filename>");
      #ifdef USEWIFI
      Serial.println ((const char*) "file download <URL> <filename>");
      #endif
      Serial.println ((const char*) "file list <filename>");
      Serial.println ((const char*) "file replay <filename>");
      Serial.println ((const char*) "file write <filename>");
      if (!summary) {
        Serial.println ((const char*) "    Various file system management commands to:");
        Serial.println ((const char*) "    dir: get directory listing");
        Serial.println ((const char*) "    del: delete the named file. NB: filenames are case sensitive");
        #ifdef USEWIFI
        Serial.println ((const char*) "    download: download the named file from the URL, no spaces in URL");
        #endif
        Serial.println ((const char*) "    list: list the contents of the named file.");
        Serial.println ((const char*) "    replay: replay the contents of the named file as a set of configuration commands");
        Serial.println ((const char*) "    write: write the named file from the command prompt, NB no editing facility.");
      }
    }
    #endif
    #ifndef NODISPLAY
    if (all || strcmp(param[1], "font")==0) {
      Serial.println ((const char*) "font [index]");
      if (!summary) {
        Serial.println ((const char*) "    Display or set font");
      }
    }
    #endif
    if (all || strcmp(param[1], "help")==0) {
      Serial.println ((const char*) "help [summary|all|<command>]");
      if (!summary) {
        Serial.println ((const char*) "    Print this help menu");
      }
    }
    if (all || strcmp(param[1], "history")==0) {
      Serial.println ((const char*) "history");
      if (!summary) {
        Serial.println ((const char*) "    Print command history since last restart");
      }
    }
    if (all || strcmp(param[1], "kill")==0 || strncmp(param[1], "auto", 4)==0) {
      Serial.println ((const char*) "kill <proc-id>");
      if (!summary) {
        Serial.println ((const char*) "    signals an automation script to stop on reaching next step");
        Serial.println ((const char*) "    also see \"run\" and \"procs\"");
      }
    }
    if (all || strcmp(param[1], "locos")==0 || strcmp(param[1], "turnouts")==0) {
      Serial.println ((const char*) "locos|turnouts");
      if (!summary) {
        Serial.println ((const char*) "    List known locomotives or turnouts");
      }
    }
    #ifdef USEWIFI
    if (all || strcmp(param[1], "mdns")==0) {
      Serial.println ((const char*) "mdns [on|off|<name>]");
      if (!summary) {
        Serial.println ((const char*) "    Use mDNS to search for wiThrottle on network, or locate service <name>");
      }
    }
    #endif
    if (all || strcmp(param[1], "memory")==0) {
      Serial.println ((const char*) "memory");
      if (!summary) {
        Serial.println ((const char*) "    Show system memory usage");
      }
    }
    if (all || strcmp(param[1], "name")==0) {
      Serial.println ((const char*) "name [<name>]");
      if (!summary) {
        Serial.println ((const char*) "    Set the name of the throttle");
      }
    }
    if (all || strcmp(param[1], "nvs")==0) {
      Serial.println ((const char*) "nvs [{<namespace>|*}]");
      if (!summary) {
        Serial.println ((const char*) "    Show contents of Non-Volatile-Storage (NVS) namespace(s)");
      }
    }
    #ifdef OTAUPDATE
    if (all || strcmp(param[1], "ota")==0) {
      Serial.println ((const char*) "ota [status|update|revert]");
      if (!summary) {
        Serial.println ((const char*) "    Manage Over The Air (OTA) updates to firmware");
        Serial.println ((const char*) "    NB: does not check hardware compatibility, use with care!");
      }
    }
    #endif
    if (all || strcmp(param[1], "partitions")==0) {
      Serial.println ((const char*) "partitions");
      if (!summary) {
        Serial.println ((const char*) "    Show eeprom partitioning scheme");
      }
    }
    if (all || strcmp(param[1], "pins")==0) {
      Serial.println ((const char*) "pins");
      if (!summary) {
        Serial.println ((const char*) "    Show processor pin assignment");
      }
    }
    if (all || strcmp(param[1], "procs")==0 || strncmp(param[1], "auto", 4)==0) {
      Serial.println ((const char*) "procs");
      if (!summary) {
        Serial.println ((const char*) "    Lists running automation scripts");
        Serial.println ((const char*) "    also see \"kill\" and \"run\"");
      }
    }
    #ifndef SERIALCTRL
    if (all || strcmp(param[1], "protocol")==0) {
      Serial.println ((const char*) "protocol {withrot|dccex}");
      if (!summary) {
        Serial.println ((const char*) "    Select default protocol to use");
      }
    }
    #endif
    if (all || strcmp(param[1], "restart")==0) {
      Serial.println ((const char*) "restart");
      if (!summary) {
        Serial.println ((const char*) "    Restart throttle");
        Serial.println ((const char*) "    temporary setting");
      }
    }
    #ifdef SCREENROTATE
    if (all || strcmp(param[1], "rotatedisplay")==0) {
      Serial.println ((const char*) "rotatedisplay [direction]");
      if (!summary) {
        Serial.println ((const char*) "    Rotate screen orientation");
      }
    }
    #endif
    if (all || strcmp(param[1], "routedelay")==0) {
      Serial.println ((const char*) "routedelay [mS_delay]");
      if (!summary) {
        Serial.println ((const char*) "    Set interval between setting each turnout in a route");
      }
    }
    if (all || strcmp(param[1], "rpn")==0 || strncmp(param[1], "auto", 4)==0) {
      Serial.println ((const char*) "rpn <expression>");
      if (!summary) {
        Serial.println ((const char*) "    Evaluates a rpn expression displaying each step");
      }
    }
    if (all || strcmp(param[1], "run")==0 || strncmp(param[1], "auto", 4)==0) {
      Serial.println ((const char*) "run <file-name>");
      if (!summary) {
        Serial.println ((const char*) "    Starts an automation script");
        Serial.println ((const char*) "    also see \"kill\" and \"procs\"");
      }
    }
    if (all || strcmp(param[1], "sendcmd")==0) {
      Serial.println ((const char*) "sendcmd <data for CS>");
      if (!summary) {
        Serial.println ((const char*) "    Send a packet of data to the command station");
        Serial.println ((const char*) "    For testing and diagnotics only, use with care!");
      }
    }
    #ifndef SERIALCTRL
    if (all || strcmp(param[1], "server")==0) {
      Serial.println ((const char*) "server [<index> <IP-address|DNS-name> [<port-number>]]");
      if (!summary) {
        Serial.println ((const char*) "    Set the server address and port");
      }
    }
    #endif
    if (all || strcmp(param[1], "set")==0) {
      Serial.println ((const char*) "set [<variable> <value>]");
      Serial.println ((const char*) "set shreg<0-9> <expression>");
      if (!summary) {
	Serial.println ((const char*) "    Set most NVS variables to a value, use with care - limited checking");
        Serial.println ((const char*) "    Without parameters set will dump all settable settings");
        Serial.println ((const char*) "    Can also be used to store a value in a shared register");
      }
    }
    #ifndef SERIALCTRL
    if (all || strcmp(param[1], "showkeepalive")==0) {
      Serial.println ((const char*) "[no]showkeepalive");
      if (!summary) {
        Serial.println ((const char*) "    Show network packets received and transmitted");
        Serial.println ((const char*) "    temporary setting");
      }
    }
    #endif
    if (all || strcmp(param[1], "showkeypad")==0) {
      Serial.println ((const char*) "[no]showkeypad");
      if (!summary) {
        Serial.println ((const char*) "    Show keypad keystrokes to console");
        Serial.println ((const char*) "    temporary setting");
      }
    }
    if (all || strcmp(param[1], "showpackets")==0) {
      Serial.println ((const char*) "[no]showpackets");
      if (!summary) {
        Serial.println ((const char*) "    Show network packets received and transmitted");
        Serial.println ((const char*) "    temporary setting");
      }
    }
    #ifdef WEBLIFETIME
    if (all || strcmp(param[1], "showweb")==0) {
      Serial.println ((const char*) "[no]showweb");
      if (!summary) {
        Serial.println ((const char*) "    Show web server headers received and transmitted");
        Serial.println ((const char*) "    temporary setting");
      }
    }
    #endif
    if (all || strcmp(param[1], "sortdata")==0) {
      Serial.println ((const char*) "[no]sortdata");
      if (!summary) {
        Serial.println ((const char*) "    sort lists of locos and turnouts");
      }
    }
    if (all || strcmp(param[1], "speedstep")==0) {
      Serial.println ((const char*) "speedstep [<1-9>]");
      if (!summary) {
        Serial.println ((const char*) "    Set the speed change set be each thottle click");
      }
    }
    if (all || strcmp(param[1], "trace")==0) {
      Serial.println ((const char*) "trace <Process-ID>");
      if (!summary) {
        Serial.println ((const char*) "    Traces the execuation of and automation script");
      }
    }
    #ifdef WARNCOLOR
    if (all || strcmp(param[1], "warnspeed")==0) {
      Serial.println ((const char*) "warnspeed [<50-101>]");
      if (!summary) {
        Serial.println ((const char*) "    change speed graph color when percentage warnspeed is exceeded");
      }
    }
    #endif
    #ifdef WEBLIFETIME
    if (all || strcmp(param[1], "webpass")==0) {
      Serial.println ((const char*) "webpass [password]");
      if (!summary) {
        Serial.println ((const char*) "    change web user password for web authentication");
      }
    }
    if (all || strcmp(param[1], "webuser")==0) {
      Serial.println ((const char*) "webuser [User-Name]");
      if (!summary) {
        Serial.println ((const char*) "    change web user for web authentication");
      }
    }
    #endif
    #ifdef USEWIFI
    if (all || strcmp(param[1], "wifi")==0) {
      Serial.println ((const char*) "wifi [<index> <ssid> [<password>]]");
      if (!summary) {
        Serial.println ((const char*) "    Set WiFi SSID and password for a known network");
        Serial.println ((const char*) "    Leave password blank for open access points");
      }
    }
    if (all || strcmp(param[1], "wifimode")==0) {
      Serial.println ((const char*) "wifimode [ap|sta|both]");
      if (!summary) {
        Serial.println ((const char*) "    Set WiFi mode to Access Point (AP), Station (sta) or both (both)");
      }
    }
    if (all || strcmp(param[1], "wifiscan")==0) {
      Serial.println ((const char*) "wifiscan [list|strength|any]");
      if (!summary) {
        Serial.println ((const char*) "    set wifi scanning technique");
        Serial.println ((const char*) "    - list: use the list of known WiFi networks as listed by preference");
        Serial.println ((const char*) "    - strength: use the strongest signal of known WiFi networks");
        Serial.println ((const char*) "    - any: use the strongest signal even if unknown open access point");
      }
    }
    #endif
    xSemaphoreGive(consoleSem);
  }
}
